{"config": [{"config": {"bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "strides": [2, 2], "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "filters": 8, "name": "conv2d", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "filters": 8, "name": "conv2d_1", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "filters": 16, "name": "conv2d_2", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "strides": [2, 2], "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "filters": 16, "name": "conv2d_3", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "filters": 32, "name": "conv2d_4", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "strides": [2, 2], "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "filters": 32, "name": "conv2d_5", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "dtype": "float32", "name": "up_sampling2d", "size": [2, 2], "data_format": "channels_last"}, "class_name": "UpSampling2D"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "filters": 32, "name": "conv2d_6", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "dtype": "float32", "name": "up_sampling2d_1", "size": [2, 2], "data_format": "channels_last"}, "class_name": "UpSampling2D"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "filters": 16, "name": "conv2d_7", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "dtype": "float32", "name": "up_sampling2d_2", "size": [2, 2], "data_format": "channels_last"}, "class_name": "UpSampling2D"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "relu", "filters": 2, "name": "conv2d_8", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3]}, "class_name": "Conv2D"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.6-tf"}